abraham120/trampoline/machines/cortex/armv7em/s32k144/drivers/fsl_flexio_i2s_driver.h
/*
 * Copyright (c) 2014 - 2016, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef FSL_FLEXIO_I2S_DRIVER_H
#define FSL_FLEXIO_I2S_DRIVER_H

#include <stddef.h>
#include <stdbool.h>
#include "fsl_device_registers.h"
#include "fsl_flexio_hal.h"
#include "fsl_flexio.h"
#include "fsl_edma_driver.h"

/*!
 * @addtogroup flexio_i2s_drv
 * @{
 */

/*******************************************************************************
 * Enumerations.
 ******************************************************************************/


/*******************************************************************************
* Definitions
******************************************************************************/


/*!
 * @brief Master configuration structure
 *
 * This structure is used to provide configuration parameters for the flexio_i2s master at initialization time.
 */
typedef struct
{
    flexio_driver_type_t driverType;        /*!< Driver type: interrupts/polling/DMA */
    uint32_t baudRate;                      /*!< Baud rate in hertz */
    uint8_t bitsWidth;                      /*!< Number of bits in a word - multiple of 8 */
    uint8_t txPin;                          /*!< Flexio pin to use for transmit */
    uint8_t rxPin;                          /*!< Flexio pin to use for receive */
    uint8_t sckPin;                         /*!< Flexio pin to use for serial clock */
    uint8_t wsPin;                          /*!< Flexio pin to use for word select */
    flexio_callback_t callback;             /*!< User callback function. Note that this function will be 
                                                  called from the interrupt service routine, so its 
                                                  execution time should be as small as possible. It can be 
                                                  NULL if it is not needed */
    void *callbackParam;                     /*!< Parameter for the callback function */
} flexio_i2s_master_user_config_t;


/*!
 * @brief Slave configuration structure
 *
 * This structure is used to provide configuration parameters for the flexio_i2s slave at initialization time.
 */
typedef struct
{
    flexio_driver_type_t driverType;        /*!< Driver type: interrupts/polling/DMA */
    uint8_t bitsWidth;                      /*!< Number of bits in a word - multiple of 8 */
    uint8_t txPin;                          /*!< Flexio pin to use for transmit */
    uint8_t rxPin;                          /*!< Flexio pin to use for receive */
    uint8_t sckPin;                         /*!< Flexio pin to use for serial clock */
    uint8_t wsPin;                          /*!< Flexio pin to use for word select */
    flexio_callback_t callback;             /*!< User callback function. Note that this function will be 
                                                  called from the interrupt service routine, so its 
                                                  execution time should be as small as possible. It can be 
                                                  NULL if it is not needed */
    void *callbackParam;                     /*!< Parameter for the callback function */
} flexio_i2s_slave_user_config_t;


/*!
 * @brief Master internal context structure
 *
 * This structure is used by the driver for its internal logic. It must
 * be provided by the application through the FLEXIO_I2S_DRV_MasterInit() function, then
 * it cannot be freed until the driver is de-initialized using FLEXIO_I2S_DRV_MasterDeinit().
 * The application should make no assumptions about the content of this structure.
 */
typedef struct
{
/*! @cond DRIVER_INTERNAL_USE_ONLY */
    flexio_common_state_t flexioCommon;    /* Common flexio drivers structure */
    const uint8_t *txData;                 /* Transmit buffer. */
    uint8_t *rxData;                       /* Receive buffer. */
    uint32_t txRemainingBytes;             /* Number of remaining bytes to be transmitted. */
    uint32_t rxRemainingBytes;             /* Number of remaining bytes to be received. */
    uint32_t dummyDmaData;                 /* Dummy location for DMA transfers. */
    edma_chn_state_t rxDMAChannel;         /* State structure for rx DMA channel */
    edma_chn_state_t txDMAChannel;         /* State structure for tx DMA channel */
    uint8_t bitsWidth;                     /* Number of bits in a word */
    uint8_t byteWidth;                     /* Number of bytes in a word */
    bool master;                           /* Current instance is in master mode */
    flexio_driver_type_t driverType;       /* Driver type: interrupts/polling/DMA */
    flexio_status_t status;                /* Current status of the driver */
    bool driverIdle;                       /* Idle/busy state of the driver */
    semaphore_t idleSemaphore;             /* Semaphore used by blocking functions */
    bool blocking;                         /* Specifies if the current transfer is blocking */
    flexio_callback_t callback;            /* User callback function */
    void *callbackParam;                   /* Parameter for the callback function */
/*! @endcond */
} flexio_i2s_master_state_t;

/*!
 * @brief Slave internal context structure
 *
 * This structure is used by the driver for its internal logic. It must
 * be provided by the application through the FLEXIO_I2S_DRV_SlaveInit() function, then
 * it cannot be freed until the driver is de-initialized using FLEXIO_I2S_DRV_SlaveDeinit().
 * The application should make no assumptions about the content of this structure.
 */
typedef flexio_i2s_master_state_t flexio_i2s_slave_state_t;


